/*****************************************************************************
	许继电气股份有限公司			版权：2008-2015

	本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许
	可不得擅自修改或发布，否则将追究相关的法律责任。

						河南许昌许继股份有限公司
						www.xjgc.com
						(0374) 321 2924
*****************************************************************************/

/******************************************************************************
	项目名称	：  SGE800计量智能终端平台
	文件名	：  adc.h
	描述		：  本文件定义了ADC模数转换模块接口
	版本		：  0.1
	作者		：  路冉冉
	创建日期	：  2009.12
******************************************************************************/
	
#ifndef _ADC_H
#define _ADC_H

#include "typedef.h"
/*************************************************
  宏定义
*************************************************/
//读函数count 参数选项
#define CHANNEL0	0		//读取外部模拟通道0
#define CHANNEL1	1		//读取外部模拟通道1
#define CHANNEL2	2		//读取外部模拟通道2
#define CHANNEL3	3		//读取外部模拟通道3
#define CHANNEL4	4		//读取内部模拟通道0
#define CHANNEL5	5		//读取内部模拟通道1
#define CHANNEL6	6		//读取内部模拟通道2
#define CHANNEL7	7		//读取内部模拟通道3

/*************************************************
  结构类型定义
*************************************************/

/*************************************************
  API
*************************************************/
/******************************************************************************
*	函数:	adc_init
*	功能:	AD转换模块初始化
*	参数:	无
*	返回:	0				-	成功
			-ERR_CFG		-	配置超限
			-ERR_BUSY		-	已经打开
			-ERR_SYS		-	系统错误
			-ERR_NOFILE		-	没有此路径
*	说明:	无
 ******************************************************************************/
int adc_init(void);

/******************************************************************************
*	函数:	adc_setwaittime
*	功能:	设置AD转换超时时间
*	参数:	timeout			-	超时时间
*	返回:	0				-	成功
			-ERR_INVAL		-	参数错误
*	说明:	timeout单位是100ms
 ******************************************************************************/
int adc_setwaittime(u16 timeout);

/******************************************************************************
*	函数:	adc_getwaittime
*	功能:	获取AD转换超时时间
*	参数:	timeout			-	超时时间（数据传出指针）
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
*	说明:	timeout单位是100ms
 ******************************************************************************/
int adc_getwaittime(u16 *timeout);

/******************************************************************************
*	函数:	adc_read
*	功能:	读取转换结果
*	参数:	id				-	AD通道号
			result			-	AD转换结果（数据传出指针）
*	返回:	0				-	成功
			-ERR_TIMEOUT	-	超时
			-ERR_NODEV 		-	无此设备
			-ERR_NOINIT		-	锁没有初始化化
			-ERR_OTHER:		-	其他关于线程互斥锁的错误
*	说明:	result是AD转换的原始值。
 ******************************************************************************/
int adc_read(u8 id, u16 *result);

/******************************************************************************
*	函数:	adc_close
*	功能:	GPIO模块关闭函数
*	参数:	无
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_NOINIT		-	没有初始化
			-ERR_OTHER		-	其他关于线程互斥锁的错误
*	说明:	无
 ******************************************************************************/
int adc_close(void);

#endif  /* _ADC_H */

