/*****************************************************************************
	许继电气股份有限公司			版权：2008-2015

	本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许
	可不得擅自修改或发布，否则将追究相关的法律责任。

						河南许昌许继股份有限公司
						www.xjgc.com
						(0374) 321 2924
*****************************************************************************/


/******************************************************************************
	项目名称	：  SGE800计量智能终端平台
	文件		：  din.h
	描述		：  本文件定义了开入检测模块接口
	版本		：  0.1
	作者		：  路冉冉
	创建日期	：  2009.12
******************************************************************************/
#ifndef _DIN_H
#define _DIN_H

#include "typedef.h"

/*************************************************
  宏定义
*************************************************/
//开入端口号
#define DIN0		0		//端口0
#define DIN1		1		//端口1
#define DIN2		2		//端口2
#define DIN3		3		//端口3
#define DIN4		4		//端口4
#define DIN5		5		//端口5
#define DIN6		6		//端口6
#define DIN7		7		//端口7

/*************************************************
  结构类型定义
*************************************************/



/*************************************************
  API
*************************************************/
/******************************************************************************
*	函数:	din_init
*	功能:	开入检测模块初始化
*	参数:	无
*	返回:	0				-	成功
			-ERR_NODEV		-	无此设备
			-ERR_CFG		-	配置超限
			-ERR_BUSY		-	已经打开
			-ERR_SYS		-	系统错误
			-ERR_NOFILE		-	没有此路径
*	说明:	无
 ******************************************************************************/
int din_init(void);

/******************************************************************************
*	函数:	din_get
*	功能:	获取开入状态
*	参数:	id				-	开入通道号
*	返回:	1				-	高电平
			0				-	低电平
			-ERR_NODEV		-	无此通道号
			-ERR_NOINIT		-	没有初始化
			-ERR_SYS		-	系统错误
			-ERR_DEVUNSTAB	-	设备不稳定
			-ERR_OTHER		-	其他关于线程互斥锁的错误
*	说明:	无
 ******************************************************************************/
int din_get(u8 id);


/******************************************************************************
*	函数:	din_close
*	功能:	关闭开入检测模块
*	参数:	无
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_NOINIT		-	没有初始化
			-ERR_OTHER		-	其他关于线程互斥锁的错误
*	说明:	无
 ******************************************************************************/
int din_close(void);


#endif  /* _DIN_H */

