/*****************************************************************************
	许继电气股份有限公司			版权：2008-2015

	本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许
	可不得擅自修改或发布，否则将追究相关的法律责任。

						河南许昌许继股份有限公司
						www.xjgc.com
						(0374) 321 2924
*****************************************************************************/


/******************************************************************************
	项目名称	：  SGE800计量智能终端平台
	文件		：  pulse.h
	描述		：  本文件定义了脉冲检测模块的接口
	版本		：  0.1
	作者		：  路冉冉
	创建日期	：  2009.12
******************************************************************************/
#ifndef _PULSE_H
#define _PULSE_H

#include "typedef.h"

/*************************************************
  宏定义
*************************************************/
//脉冲通道号
#define PULSE0		0		//端口0
#define PULSE1		1		//端口1
#define PULSE2		2		//端口2
#define PULSE3		3		//端口3
#define PULSE4		4		//端口4
#define PULSE5		5		//端口5
#define PULSE6		6		//端口6
#define PULSE7		7		//端口7

/*************************************************
  结构类型定义
*************************************************/

/*************************************************
  API
*************************************************/
/******************************************************************************
*	函数:	pulse_init
*	功能:	脉冲检测模块初始化
*	参数:	无
*	返回:	0				-	成功
			-ERR_CFG		-	配置超限
			-ERR_BUSY		-	已经打开
			-ERR_SYS		-	系统错误
			-ERR_NOFILE		-	没有此路径
 * 说明:	无
 ******************************************************************************/
int pulse_init(void);

/******************************************************************************
*	函数:	pulse_get
*	功能:	获得脉冲计数累积量（读后不清零）
*	参数:	id				-	脉冲通道号
			num				-	脉冲数（数据传出）
*	返回:	0				-	成功
			-ERR_INVAL		-	参数错误
			-ERR_NODEV		-	无此设备
			-ERR_SYS		-	系统错误，ioctl调用失败
			-ERR_NOINIT		-	锁没有初始化化
			-ERR_OTHER:		-	其他关于线程互斥锁的错误
*	说明:	num为32位无符号整型，溢出后即重新从0开始。此函数需在2.5秒内循环调用，
 			否则会可能丢失脉冲。
 ******************************************************************************/
int pulse_get(u8 id, u32 *num);

/******************************************************************************
*	函数:	pulse_close
*	功能:	关闭脉冲检测模块
*	参数:	无
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_NOINIT		-	没有初始化
			-ERR_OTHER		-	其他关于线程互斥锁的错误
*	说明:	无
 ******************************************************************************/
int pulse_close(void);

#endif  /* _PULSE_H */
