/*****************************************************************************/
/*许继电气股份有限公司                                     版权：2008-2015   */
/*****************************************************************************/
/* 本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许    */
/* 可不得擅自修改或发布，否则将追究相关的法律责任。                          */
/*                                                                           */
/*                      河南许昌许继股份有限公司                             */
/*                      www.xjgc.com                                         */
/*                      (0374) 321 2924                                      */
/*                                                                           */
/*****************************************************************************/


/******************************************************************************
    项目名称    ：  SGE800计量终端业务平台
    文 件 名       ： sdev_485.c
    描          述    ：  本文件用于业务平台库数据流设备485口功能的实现
    版          本    ：  0.1
    作          者    ：  孙锐
    创建日期    ：  2010.04
******************************************************************************/

//C库头文件
#include <stdio.h>			//printf
#include <stdlib.h>		    //exit
#include <unistd.h>		    //sleep
//#include <db.h>
#include <string.h>
#include <pthread.h>
#include <errno.h>

//平台库头文件
#include "include/comport.h"
#include "private/config.h"
#include "include/error.h"
#include "include/sdev.h"

/*************************************************************
 *宏定义
 *************************************************************/

/******************************************************************************
*	函数:	sdev_485_setconfig
*	功能:	配置485口
*	参数:
*	返回:	0				-	成功
			-ESYS			-	系统错误
			-ERR_INVAL		-	参数无效
			-ERR_NOINIT		-	没有初始化

*	说明:	无
******************************************************************************/
int sdev_485_setconfig(u8 cmd, void *cfg)
{
	int ret;
	ret = comport_setconfig (CFG_SDEV_485_COMPORT, (comport_config_t *)cfg);
	if (ret){
		goto error;
	}
	ret = 0;
error:
	return(ret);
}

/******************************************************************************
*	函数:	sdev_485_getconfig
*	功能:	获取485口属性
*	参数:
*	返回:	0				-	成功
			-ERR_INVAL		-	参数无效
			-ERR_NOINIT		-	没有初始化

*	说明:	无
******************************************************************************/
int sdev_485_getconfig(u8 cmd, void *cfg)
{
	int ret;
	ret = comport_getconfig (CFG_SDEV_485_COMPORT, (comport_config_t *)cfg);
	if (ret){
		goto error;
	}
	ret = 0;
error:
	return(ret);
}

/******************************************************************************
*	函数:	sdev_485_send
*	功能:	485口发送数据
*	参数:	buf				-	发送数据起始指针
			count			-	发送数据长度
*	返回:	>=0				-	发送成功的字节数
			-ESYS			-	系统错误
			-ERR_INVAL		-	参数无效
			-ERR_NOINIT		-	没有初始化

*	说明:	超时时间通过配置发送超时定
******************************************************************************/
int sdev_485_send(u8 *buf, u32 count)
{
	int ret;
	ret = comport_send (CFG_SDEV_485_COMPORT, buf, count);
	if (ret < 0){
		goto error;
	}
error:
	return(ret);
}

/******************************************************************************
*	函数:	sdev_485_recv
*	功能:	485口接收数据
*	参数:	buf				-	接收数据起始指针
			count			-	接收缓冲区长度
*	返回:	>=0				-	接收成功的字节数
			-ERR_SYS		-	错误
			-ERR_INVAL		-	参数无效
			-ERR_NOINIT		-	没有初始化

*	说明:
******************************************************************************/
int sdev_485_recv(u8 *buf, u32 count, u8 *type, u8 *tel)
{
	int ret;
	ret = comport_recv(CFG_SDEV_485_COMPORT, buf, count);
	if (ret < 0){
		goto error;
	}
error:
	return(ret);
}

/******************************************************************************
*	函数:	sdev_485_sendsmg
*	功能:	无
*	参数:
*	返回:

*	说明:	空函数
******************************************************************************/
int sdev_485_sendsmg(u8 *buf, u32 count, u8 *telnum, u8 tellen)
{
	return(0);
}

/******************************************************************************
*	函数:	sdev_485_recvsmg
*	功能:	无
*	参数:
*	返回:	0				-	成功(收到确认命令)
			-ERR_TIMEOUT	-	连接超时

*	说明:	空函数
******************************************************************************/
int sdev_485_recvsmg(u8 *buf, u32 count)
{
	return(0);
}
/******************************************************************************
*	函数:	sdev_485_connect
*	功能:
*	参数:	mode			-	连接方式：0创建新连接；1激活重连
*	返回:	0				-	成功(收到确认命令)
			-ERR_TIMEOUT	-	连接超时

*	说明:	无
******************************************************************************/
int sdev_485_connect(u8 mode)
{
	return(0);
}

/******************************************************************************
*	函数:	sdev_485_disconnect
*	功能:	无
*	参数:
*	返回:	0				-	成功(收到确认命令)
			-ERR_TIMEOUT	-	连接超时

*	说明:	无
******************************************************************************/
int sdev_485_disconnect(void)
{
	return(0);
}

/******************************************************************************
*	函数:	sdev_485_getstat
*	功能:	获得状态
*	参数:
*	返回:	0				-	成功


*	说明:	无
******************************************************************************/
int sdev_485_getstat(u8 cmd, void *stat)
{
	return(0);
}

/******************************************************************************
*	函数:	sdev_485_turnon
*	功能:	无
*	参数:
*	返回:	0				-	成功


*	说明:	无
******************************************************************************/
int sdev_485_turnon(void)
{
	return(0);
}

/******************************************************************************
*	函数:	sdev_485_turnoff
*	功能:	无
*	参数:
*	返回:

*	说明:	无
******************************************************************************/
int sdev_485_turnoff(void)
{
	return(0);
}


/******************************************************************************
*	函数:	sdev_485_poweron
*	功能:	上电
*	参数:
*	返回:	0				-	成功


*	说明:	无
******************************************************************************/
int sdev_485_poweron(void)
{
	return(0);
}

/******************************************************************************
*	函数:	sdev_485_poweroff
*	功能:	掉电
*	参数:
*	返回:	0				-	成功


*	说明:	无
******************************************************************************/
int sdev_485_poweroff(void)
{
	return(0);
}

/******************************************************************************
*	函数:	sdev_485_reset
*	功能:	无
*	参数:
*	返回:	0				-	成功


*	说明:	无
******************************************************************************/
int sdev_485_reset(void)
{
	return(0);
}

