/*****************************************************************************
	许继电气股份有限公司			版权：2008-2015

	本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许
	可不得擅自修改或发布，否则将追究相关的法律责任。

						河南许昌许继股份有限公司
						www.xjgc.com
						(0374) 321 2924
*****************************************************************************/


/******************************************************************************
	项目名称	：SGE800计量智能终端平台
	文件		：error.h
	描述		：本文件定义了平台API返回的错误类型
	版本		：0.1
	作者		：万鸿俊
	创建日期	：2009.09
******************************************************************************/

#ifndef _ERROR_H
#define _ERROR_H

/*************************************************
  宏定义
*************************************************/
#define ERR_SYS			1		/* 系统异常 */
#define ERR_NODEV		2		/* 无此设备 */
#define ERR_NOFILE		2		/* 文件不存在 */
#define ERR_TIMEOUT		3		/* 超时 */
#define ERR_INVAL		4		/* 参数值无效 */
#define ERR_NOFUN		5		/* 无此功能 */
#define ERR_BUSY		6		/* 设备忙 */
#define ERR_NOINIT		7		/* 未初始化 */
#define	ERR_NOMEM		8		/* 无可用内存 */
#define ERR_NODISK		9		/* 无可用存储空间 */
#define ERR_NORECORD	10     	/* 记录不存在 */
#define ERR_CFG			11     	/* 配置出错 */
#define ERR_NOCFG		12		/* 未配置 */ 
#define ERR_DEVUNSTAB	13     	/* 设备不稳定 */
#define ERR_DISCONNECT	14      /* 连接已断开 */

#define ERR_OTHER		80		/* 其他错误 */

#endif	/* _ERROR_H */
