/*****************************************************************************
	许继电气股份有限公司			版权：2008-2015

	本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许
	可不得擅自修改或发布，否则将追究相关的法律责任。

						河南许昌许继股份有限公司
						www.xjgc.com
						(0374) 321 2924
*****************************************************************************/


/******************************************************************************
	项目名称	：  SGE800计量智能终端业务平台
	文件		：  gprs_me3000.h
	描述		：  本文件定义了gprs3000模块的API接口
	版本		：  0.1
	作者		：  孙锐
	创建日期	：  2010.4
******************************************************************************/

#ifndef _ME3000_H
#define _ME3000_H

#include "typedef.h"

/*************************************************
  宏定义
*************************************************/

//GPRS模块的配置
#define CFG_DATA_MAX			512				//配置缓存数据最大长度（包括提示符的字节数）
#define CFG_SEND_TIMEOUT		2				//发送超时
#define CFG_RECV_TIMEOUT		1				//接收超时：有个计算方法决定两次接收之间的最小时间间隔（否则有可能会丢数据）
#define CFG_SMS_MAX				8				//最大短信分帧数
#define	CFG_SMS_LEN_MAX			140				//单条短信最大长度
#define	CFG_RECV_BACKMAX		20				//接收到返回交互命令的最大长度
#define CFG_SMS_CENTER			"13800210500"	//短信中心号码

#define CFG_GPRS_POWER_IO		5				//gprs模块开关机控制信号
#define	CFG_GPRS_POWER_IO_VAL	1				//开关控制信号状态
#define CFG_GPRS_POWER_IO_OD	1				//OD门使能标识：1使能
#define CFG_GPRS_POWER_IO_PU	1				//上拉电阻使能标识：1使能




/*************************************************
  API
*************************************************/
/******************************************************************************
*	函数:	gprs_me3000_init
*	功能:	me3000初始化
*	参数:
*	返回:	0				-	成功(收到确认命令)
			-ERR_SYS		-	系统错误
*	说明:	无
******************************************************************************/
int gprs_me3000_init();

/******************************************************************************
*	函数:	gprs_me3000_setconfig
*	功能:	配置串口或gprs模块
*	参数:	cmd				-	0：配置串口；1：配置gprs模块
			cfg				-	配置接口
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误

*	说明:	无
******************************************************************************/
int gprs_me3000_setconfig(u8 cmd, void *cfg);

/******************************************************************************
*	函数:	gprs_me3000_getconfig
*	功能:	获取串口或gprs模块属性
*	参数:	cmd				-	0：配置串口；1：配置gprs模块
			cfg				-	配置接口
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误

*	说明:	无
******************************************************************************/
int gprs_me3000_getconfig(u8 cmd, void *cfg);

/******************************************************************************
*	函数:	gprs_me3000_send
*	功能:	GPRS发送数据
*	参数:	buf				-	发送数据起始指针
			count			-	发送数据长度
*	返回:	>0				-	成功(返回实际发送成功的字节数)
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
 		    -ERR_DISCONNECT	-	未连接
 		    -ERR_BUSY		-	设备忙

*	说明:	超时时间通过配置发送超时定
******************************************************************************/
int gprs_me3000_send(u8 *buf, u32 count);

/******************************************************************************
*	函数:	gprs_me3000_recv
*	功能:	GPRS接收数据（N秒未收取可能被清空）
*	参数:	buf				-	接收数据起始指针
			count			-	接收缓冲区长度
*	返回:	>0				-	成功(返回实际发送成功的字节数)
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
 		    -ERR_DISCONNECT	-	未连接
 		    -ERR_BUSY		-	设备忙
 		    -ERR_NOMEM		-	接口存储空间小---丢帧

*	说明:	type为0收到短信，type = 1收到tcp数据，type=2收到udp数据，type=3，收到消息提示
			循环调用改函数接收数据，2s内未调用已接收的数据可能被新的数据替换掉；返回接收到数据后应该将数据拷贝出来处理
			并重新调用该函数继续接收数据直到返回为0,休眠一段时间（2S内）重新调用。
******************************************************************************/
int gprs_me3000_recv(u8 *buf, u32 count, u8 *type, u8 *tel);

/******************************************************************************
*	函数:	gprs_me3000_sendsmg
*	功能:	发送短息
*	参数:	buf				-	发送数据起始指针
			count			-	发送数据长度
			telnum			-	发送方电话号码起始指针（可以是11个字节的电话号码也可以是6个字节的udp号码格式）
			tellen			-	电话号码长度
*	返回:	>0				-	成功(返回实际发送成功的字节数)累计流量用
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
 		    -ERR_DISCONNECT	-	未连接
 		    -ERR_BUSY		-	设备忙
 		    -ERR_NOMEM		-	接口存储空间小---丢帧

*	说明:
******************************************************************************/
int gprs_me3000_sendsmg(u8 *buf, u32 count, u8 *telnum, u8 tellen);

/******************************************************************************
*	函数:	gprs_me3000_recvsmg
*	功能:	gprs模块读短信
*	参数:
*	返回:	0				-	成功(收到确认命令)
			-ERR_TIMEOUT	-	连接超时

*	说明:	无
******************************************************************************/
int gprs_me3000_recvsmg(u8 *buf, u32 count);

/******************************************************************************
*	函数:	gprs_me3000_connect
*	功能:	gprs模块建立连接
*	参数:	mode			-	连接方式：0创建新连接；1激活重连
*	返回:	0				-	成功(收到确认命令)
			-ERR_TIMEOUT	-	连接超时

*	说明:	无
******************************************************************************/
int gprs_me3000_connect(u8 mode);

/******************************************************************************
*	函数:	gprs_me3000_disconnect
*	功能:	gprs模块断开连接
*	参数:
*	返回:	0				-	成功(收到确认命令)
			-ERR_TIMEOUT	-	连接超时

*	说明:	无
******************************************************************************/
int gprs_me3000_disconnect(void);

/******************************************************************************
*	函数:	gprs_me3000_getstat
*	功能:	获得状态
*	参数:
*	返回:	0				-	成功


*	说明:	无
******************************************************************************/
int gprs_me3000_getstat(u8 cmd, void *stat);

/******************************************************************************
*	函数:	gprs_me3000_turnon
*	功能:	开机
*	参数:
*	返回:	0				-	成功


*	说明:	无
******************************************************************************/
int gprs_me3000_turnon(void);

/******************************************************************************
*	函数:	gprs_me3000_turnoff
*	功能:	关机
*	参数:
*	返回:	0				-	成功
			-ERR_TIMEOUT	-	超时

*	说明:	硬件断电前应先软关机，保护GPRS模块
******************************************************************************/
int gprs_me3000_turnoff(void);


/******************************************************************************
*	函数:	gprs_me3000_poweron
*	功能:	上电
*	参数:
*	返回:	0				-	成功


*	说明:	无
******************************************************************************/
int gprs_me3000_poweron(void);

/******************************************************************************
*	函数:	gprs_me3000_poweroff
*	功能:	掉电
*	参数:
*	返回:	0				-	成功


*	说明:	无
******************************************************************************/
int gprs_me3000_poweroff(void);

/******************************************************************************
*	函数:	gprs_me3000_reset
*	功能:	重新启动
*	参数:
*	返回:	0				-	成功


*	说明:	无
******************************************************************************/
int gprs_me3000_reset(void);


#endif  /* _ME3000_H */
