/*****************************************************************************
	许继电气股份有限公司			版权：2008-2015

	本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许
	可不得擅自修改或发布，否则将追究相关的法律责任。

						河南许昌许继股份有限公司
						www.xjgc.com
						(0374) 321 2924
*****************************************************************************/


/******************************************************************************
	项目名称	：  SGE800计量智能终端平台
	文件		：  key.h
	描述		：  本文件定义了键盘模块的接口
	版本		：  0.1
	作者		：  路冉冉
	创建日期	：  2010.04
******************************************************************************/
#ifndef _KEY_H
#define _KEY_H

#include "typedef.h"
	
/*************************************************
  静态全局变量及宏定义
*************************************************/
//key编号

#define KEY1		1		//端口1
#define KEY2		2		//端口2
#define KEY3		3		//端口3
#define KEY4		4		//端口4
#define KEY5		5		//端口5
#define KEY6		6		//端口6
#define KEY7		7		//端口7
#define KEY8		8		//端口7

/*************************************************
  API
*************************************************/
/******************************************************************************
*	函数:	key_init
*	功能:	按键模块初始化
*	参数:	无
*	返回:	0				-	成功
			-ERR_CFG		-	配置超限
			-ERR_BUSY		-	已经打开
	说明:本函数出错，大部分返回gpio.h中gpio_init及gpio_set函数的错误
 ******************************************************************************/
int key_init(void);

/******************************************************************************
*	函数:	key_get
*	功能:	获取按键有效状态
*	参数:	timeout			-	超时时间（单位为秒,为0表示永久阻塞））
*	返回:	0				-	无键按下
*			0~15			-	对应键号按下
*			100~115			-	对应键号长按
			-ERR_NOINIT		-	没有初始化
*	说明:本函数出错，大部分返回gpio.h中gpio_input_get函数的错误
 ******************************************************************************/
int key_get(u8 timeout);

/******************************************************************************
*	函数:	key_close
*	功能:	按键模块关闭函数
*	参数:	无
*	返回:	0				-	成功
			-ERR_NOINIT		-	没有初始化
*	说明:本函数出错，大部分返回gpio.h中gpio_close函数的错误
 ******************************************************************************/
int key_close(void);

#endif		//_KEY_H
