/*****************************************************************************
	许继电气股份有限公司			版权：2008-2015

	本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许
	可不得擅自修改或发布，否则将追究相关的法律责任。

						河南许昌许继股份有限公司
						www.xjgc.com
						(0374) 321 2924
*****************************************************************************/


/******************************************************************************
	项目名称	：  SGE800计量智能终端业务平台
	文件		：  sdev.h
	描述		：  本文件定义了数据流设备接口
	版本		：  0.1
	作者		：  孙锐
	创建日期	：  2010.4
******************************************************************************/
#ifndef SDEV_H_
#define SDEV_H_


#include "typedef.h"


/*************************************************
  结构类型定义
*************************************************/
//数据流设备
#define CFG_SDEV_MAX			20				//数据流设备的最大值
#define CFG_GPRS_ME3000    		1				//配置ME3000对应的数据流编号
#define CFG_GPRS_ME3000_COMPORT	1				//配置ME3000对应的串口号
#define	CFG_SDEV_485			2				//配置485口对应的数据流编号
#define CFG_SDEV_485_COMPORT	2				//配置485口对应的串口号
#define CFG_SDEV_NET			3				//配置网络客户端对应的数据流编号


/*************************************************
  API
*************************************************/
/******************************************************************************
*	函数:	streamdev_open
*	功能:	打开数据流设备
*	参数:
*	返回:	0				-	成功


*	说明:	无
******************************************************************************/
struct sdevhandle * streamdev_open(u8 id);
#endif /* SDEV_H_ */
