/*****************************************************************************
	许继电气股份有限公司			版权：2008-2015

	本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许
	可不得擅自修改或发布，否则将追究相关的法律责任。

						河南许昌许继股份有限公司
						www.xjgc.com
						(0374) 321 2924
*****************************************************************************/


/******************************************************************************
	项目名称	：  SGE800计量智能终端平台
	文件		：  swin.h
	描述		：  本文件定义了遥信及脉冲检测模块的接口
	版本		：  0.1
	作者		：  路冉冉
	创建日期	：  2010.4
******************************************************************************/
#ifndef _SWIN_H
#define _SWIN_H

#include "typedef.h"
#include "rtc.h"				//实时时钟时间结构体

/*************************************************
  宏定义
*************************************************/
//脉冲通道号
#define SWIN0		0		//遥信或脉冲编号0
#define SWIN1		1		//遥信或脉冲编号1
#define SWIN2		2		//遥信或脉冲编号2
#define SWIN3		3		//遥信或脉冲编号3
#define SWIN4		4		//遥信或脉冲编号4
#define SWIN5		5		//遥信或脉冲编号5
#define SWIN6		6		//遥信或脉冲编号6
#define SWIN7		7		//遥信或脉冲编号7

#define PULSE		2		//设置io功能编码-脉冲
#define REMSIG		1		//设置io功能编码-遥信

/*************************************************
  结构类型定义
*************************************************/
typedef struct{
	u8	polar;						//变位极性 1-正跳变，0-负跳变
	rtc_time_t	time;				//变位时刻
}swin_jump_t;

typedef struct{
	u32	num;
	swin_jump_t	jump[8];			//最大存储8个遥信变位时刻及极性
}swin_time_t;

/*************************************************
  API
*************************************************/
/******************************************************************************
*	函数:	swin_init
*	功能:	脉冲检测模块初始化
*	参数:	无
*	返回:	0				-	成功
			-ERR_CFG		-	配置超限
			-ERR_BUSY		-	已经打开
			-ERR_SYS		-	系统错误
			-ERR_NOFILE		-	没有此路径
 * 说明:	无
 ******************************************************************************/
int swin_init(void);

/******************************************************************************
*	函数:	swin_set
*	功能:	设置开入模式
*	参数:	id				-	开入通道号
			mode			-	1-遥信,0-脉冲
*	返回:	0				-	成功
			-ERR_INVAL		-	参数错误
			-ERR_NODEV		-	无此设备
*	说明:
 ******************************************************************************/
int swin_set(u8 id, u8 mode);

/******************************************************************************
*	函数:	swin_process
*	功能:	处理出所有开入的结果（包括脉冲数，遥信变位时刻）
*	参数:
*	返回:	>=0				-	标志位，低16位表示各通道是否有变化
			-ERR_INVAL		-	参数错误
			-ERR_SYS		-	系统错误，ioctl调用失败或实时时钟读取时间错误
			-ERR_NOINIT		-	锁或实时时钟模块没有初始化化
			-ERR_OTHER:		-	其他关于线程互斥锁的错误
*	说明:
 ******************************************************************************/
int swin_process(void);

/******************************************************************************
*	函数:	swin_read
*	功能:	读出指定通道号的脉冲数或遥信变位时刻
*	参数:	id				-	脉冲通道号
			p				-	脉冲数或遥信变位时刻（数据传出）
*	返回:	0				-	成功
			-ERR_INVAL		-	参数错误
			-ERR_NODEV		-	无此设备
			-ERR_NOINIT		-	模块没有初始化化
*	说明:
 ******************************************************************************/
int swin_read(u8 id,swin_time_t *p);

/******************************************************************************
*	函数:	swin_check
*	功能:	实时查询当前状态
*	参数:	id				-	脉冲通道号
*	返回:	0				-	当前状态为低电平
*			1				-	当前状态为高电平
			-ERR_NODEV		-	无此设备
			-ERR_SYS		-	系统错误，gpio驱动ioctl调用失败
			-ERR_DEVUNSTAB	-	设备不稳定
*	说明:
 ******************************************************************************/
int swin_check(u8 id);

/******************************************************************************
*	函数:	swin_close
*	功能:	关闭遥信与脉冲模块
*	参数:	无
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_NOINIT		-	没有初始化
			-ERR_OTHER		-	其他关于线程互斥锁的错误
*	说明:	无
 ******************************************************************************/
int swin_close(void);

#endif  /* _SWIN_H */
