/**
* cenmet_alm.c -- 表计告警监测
* 
* 
* 创建时间: 2010-6-12
* 最后修改时间: 2010-6-14
*/

#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#include "include/debug.h"
#include "include/sys/schedule.h"
#include "include/sys/timeal.h"
#include "include/lib/bcd.h"
#include "include/lib/align.h"
#include "include/param/capconf.h"
#include "include/param/hardware.h"
#include "include/param/meter.h"
#include "include/param/metp.h"
#include "include/param/mix.h"
#include "include/monitor/runstate.h"
#include "include/monitor/alarm.h"
#include "cenmet_proto.h"
#include "cenmet_comm.h"
#include "mdb/mdbcur.h"
#include "mdb/mdbana.h"
#include "include/debug/shellcmd.h"

#define CENMETALARM_DEBUG		1

#ifndef CENMETALARM_DEBUG
	#define TestPrint			DebugPrint
#else
	#define TestPrint(a,...)
#endif

#define ALARM_MID(mid)		(mid+1)

#define CLR_ALMBUF(pbuf)    {memset((unsigned char *)(pbuf), 0, sizeof(alarm_t));}

#define MALMFLAG_DEALING	0x8000
#define MALMFLAG_ALMED		0x4000
#define MALMFLAG_IDX		0x0fff
#define MALMTIME_MASK		0x3fff
#define MALMTIME_MAX		(MALMTIME_MASK+1)
typedef struct {
	unsigned short flag;
	unsigned short time; 
} cenmet_alm_t;


//只针对特定测量点有效
typedef struct {
	cenmet_alm_t diff[MAX_DIFFA];    //差动告警
	cenmet_alm_t vol_rph;    //电压回路逆相序
	cenmet_alm_t ctsc2[3];    //ABC相CT 二次侧短路
	cenmet_alm_t ctoc2[3];    //ABC相CT 二次侧开路
	//cenmet_alm_t ampr[3];    //ABC相电流反极性
} malm1_stat_t;

static const char *name_malm1[] = {
	"差动告警1",
	"差动告警2", 
	"电压回路逆相序",
};

// 示度判断
typedef struct {
	unsigned char ene_fly;    //电表飞走
	unsigned char ene_stop;    //电表停走
	unsigned char ene_diff;    //电表超差
	unsigned char ene_del;    //示度下降
	unsigned char prg_chg;    //电表编程时间更改
	unsigned char prd_chg;    //电表时段或费率更改
	unsigned char day_chg;    //电表抄表日更改
	unsigned char pls_chg;    //电表脉冲常数更改
	unsigned char clk_chg;    //电表时钟异常
	unsigned char bei_chg;    //电表互感器倍率更改
	unsigned char bat_low;    //电表电池电压低
	unsigned char need_zero;    //最大需量清零

	unsigned int bak_enepa;    //9010
	unsigned int bak_enena;    //9020
	unsigned short cnt_enestop;
	unsigned char bak_prd[24];    //C33F, 电表时段
	unsigned char bak_prgcnt[2];    //B212, 编程次数
	unsigned char bak_cpyday[2];    //C117, 自动抄表日
	unsigned char bak_pls[6];    //C030, C031, 有功脉冲常数
	unsigned char bak_bei[4];    //C035, C036, 互感器倍率
	unsigned char bak_need[2];   //B213, 需量清零次数
	unsigned char bak_vbrcnt[2];  //B310, 总断相次数
} malm2_stat_t;

static const char *name_malm2[]  = {
	"电表飞走",
	"电表停走",
	"电表超差",
	"示度下降",
	"电表编程时间更改",
	"电表时段或费率更改",
	"电表抄表日更改",
	"电表脉冲常数更改",
	"电表时钟异常",
	"电表互感器倍率更改",
	"电表电池电压低",
	"最大需量清零",
};

//对每个测量点有效
typedef struct {
	cenmet_alm_t volbr[3];    //ABC相电压断相
	cenmet_alm_t volls[3];    //ABC相电压失压
	cenmet_alm_t volov[3];   //ABC电压过压
	cenmet_alm_t ampov[3];   //ABC电流过上上限
	cenmet_alm_t amplm[3];   //ABC电流过上限
	cenmet_alm_t pwrvov;    //视在功率越上上限
	cenmet_alm_t pwrvlm;    //视在功率越上限
	cenmet_alm_t unb_vol;    //电压不平衡
	cenmet_alm_t unb_amp;    //电流不平衡
	cenmet_alm_t zamp_ab;    //零序电流偏大
	cenmet_alm_t amprev[3];    //电流反极性
} malm3_stat_t;

static const char *name_malm3[] = {
	"A相电压断相",
	"B相电压断相",
	"C相电压断相",
	"A相电压失压",
	"B相电压失压",
	"C相电压失压",
	"A相电压过压",
	"B相电压过压",
	"C相电压过压",
	"A相电流越上上限",
	"B相电流越上上限",
	"C相电流越上上限",
	"A相电流越上限",
	"B相电流越上限",
	"C相电流越上限",
	"视在功率越上上限",
	"视在功率越上限",
	"电压不平衡",
	"电流不平衡",
