/******************************************************************************
	项目名称	：SGE800计量智能终端业务平台
	文件		：message.h
	描述		：本文件定义了消息调度模块接口
	版本		：0.1
	作者		：万鸿俊
	创建日期	：2010.11
******************************************************************************/

#ifndef _MESSAGE_H
#define _MESSAGE_H

#include "base.h"

/*************************************************
  结构类型定义
*************************************************/
//业务平台消息枚举
enum {
	MSG_TIME,					//时间消息
	MSG_KEY,                    //按键消息
	MSG_SKEY,                   //特殊按键消息（比如编程键）
	MSG_DIN,                    //开入变位消息
	MSG_PULSE,                  //脉冲变化消息
	MSG_PARA,                   //参数变化消息
	MSG_POWER,                  //掉电上电消息
	MSG_DEVICE_DATA_NET,        //网络数据消息
	MSG_DEVICE_STATE_NET,
	MSG_DEVICE_DATA_GPRS,       //
	MSG_DEVICE_DATA_ZB,         //
	MSG_DEVICE_DATA_IRDA,       //
	MSG_DEVICE_DATA_DEBUG,      //
	MSG_DEVICE_DATA_USBD,       //
	MSG_DEVICE_DATA_JC,         //
	MSG_DEVICE_DATA_485_1,      //
	MSG_DEVICE_DATA_485_2,      //
	MSG_DEVICE_DATA_485_3,      //
	MSG_FRAMEWORK_LAST          //业务模块定义消息枚举值从此值开始
};

/*************************************************
  API
*************************************************/
/******************************************************************************
*	函数:	message_init
*	功能:	消息调度模块初始化
*	参数:
*	返回:	0				-	成功
 			-ERR_SYS		-	系统错误
			-ERR_BUSY		- 	模块已初始化
*	说明:	此函数由framework_init调用。
 ******************************************************************************/
int message_init (void);

/******************************************************************************
*	函数:	message_subscribe
*	功能:	订阅消息
*	参数:	obj				-	业务模块对象指针
			type			-	消息类型枚举值
*	返回:	0				-	成功
 			-ERR_SYS		-	系统错误
			-ERR_INVAL		- 	无效参数
			-ERR_NOMEM		- 	无可用订阅空间
*	说明:
 ******************************************************************************/
int message_subscribe (struct BASE *obj, u16 type);

/******************************************************************************
*	函数:	message_unsubscribe
*	功能:	取消订阅消息
*	参数:	obj				-	业务模块对象指针
			type			-	消息类型枚举值
*	返回:	0				-	成功
 			-ERR_SYS		-	系统错误
			-ERR_INVAL		- 	无效参数
			-ERR_NORECORD	- 	此消息未订阅
*	说明:
 ******************************************************************************/
int message_unsubscribe (struct BASE *obj, u16 type);

/******************************************************************************
*	函数:	message_dispatch
*	功能:	派发消息
*	参数:	msg				-	消息内容
*	返回:	0				-	成功
 			-ERR_SYS		-	系统错误
			-ERR_INVAL		- 	无效参数
 			-ERR_NOMEM		-	消息队列满
*	说明:
 ******************************************************************************/
int message_dispatch (message_t *msg);

#endif
