/*****************************************************************************/
/*许继电气股份有限公司                                     版权：2008-2015   */
/*****************************************************************************/
/* 本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许    */
/* 可不得擅自修改或发布，否则将追究相关的法律责任。                          */
/*                                                                           */
/*                      河南许昌许继股份有限公司                             */
/*                      www.xjgc.com                                         */
/*                      (0374) 321 2924                                      */
/*                                                                           */
/*****************************************************************************/


/******************************************************************************
    项目名称    ：  SGE800计量智能终端平台
    文件名      ：  pulselib.h
    描述        ：  本文件定义了IO操作模块的接口
    版本        ：  0.1
    作者        ：  路冉冉
    创建日期    ：  2009.12
******************************************************************************/
#ifndef _PULSELIB_H
#define _PULSELIB_H

#define PS_IOC_MAGIC 0xE3
 
#define SET_TC		_IO(PS_IOC_MAGIC,  0)	//选择用那个定时器作为5ms定时
#define SET_COUNT	_IO(PS_IOC_MAGIC,  1)	//设置TIMER为频率测量功能
#define ADD_IO		_IO(PS_IOC_MAGIC,  2)	//设置TIMER为脉宽调制功能
#define PSTART		_IO(PS_IOC_MAGIC,  3)	//设置timer时钟



#endif  /* _PULSELIB_H */

