/*****************************************************************************
	许继电气股份有限公司			版权：2008-2015

	本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许
	可不得擅自修改或发布，否则将追究相关的法律责任。

						河南许昌许继股份有限公司
						www.xjgc.com
						(0374) 321 2924
*****************************************************************************/


/******************************************************************************
	项目名称	：SGE800计量智能终端平台
	文件		：timer.h
	描述		：本文件定义了定时器模块接口
	版本		：0.1
	作者		：万鸿俊
	创建日期	：2009.11
******************************************************************************/

#ifndef _TIMER_H
#define _TIMER_H

#include "typedef.h"

/*************************************************
  宏定义
*************************************************/
//定时器通道号
#define TIMER0					0		//端口0
#define TIMER1					1		//端口1
#define TIMER2					2		//端口2
#define TIMER3					3		//端口3
#define TIMER4					4		//端口4
#define TIMER5					5		//端口5
//定时器操作模式
#define TIMER_MODE_HEART		1	//设置TIMER为心跳产生功能
#define TIMER_MODE_MEASURE		2	//设置TIMER为频率测量功能
#define TIMER_MODE_PWM			3	//设置TIMER为脉宽调制功能
//定时器精度等级
#define TIMER_PRECISION_HIGH	1	//高精度
#define TIMER_PRECISION_LOW	2	//低精度

/*************************************************
  结构类型定义
*************************************************/



/*************************************************
  API
*************************************************/
/******************************************************************************
*	函数:	timer_init
*	功能:	定时器模块初始化
*	参数:	id				-	定时器通道号
			mode			-	定时器操作模式
*	返回:	0				-	成功
			-ERR_NODEV		-	无此设备
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	参数无效
			-ERR_BUSY		-	已经打开
			-ERR_NOFILE		-	没有此路径
*	说明:	定时器工作模式包括周期定时、PWM波、频率测量。
 ******************************************************************************/
int timer_init (u8 id, u8 mode);


/******************************************************************************
*	函数:	timer_heart_setconfig
*	功能:	定时器心跳模式下配置
*	参数:	id				-	定时器通道号
			interval		-	周期定时的间隔（10ms的倍数或者125ms的倍数）
*	返回:	0				-	成功
			-ERR_NOFUN		-	无此功能
			-ERR_INVAL		-	参数错误
			-ERR_SYS		-	系统错误
			-ERR_NOINIT		-	没初始化
*	说明:	如果在没有关掉定时器时，再次配置延时时间，会报-ERR_SYS错误
 ******************************************************************************/
int timer_heart_setconfig (u8 id, u32 interval);


/******************************************************************************
*	函数:	timer_heart_getconfig
*	功能:	定时器心跳模式下读取配置
*	参数:	id				-	定时器通道号
			interval		-	周期定时的间隔（数据传出指针）
*	返回:	0				-	成功
			-ERR_NOFUN		-	无此功能
			-ERR_INVAL		-	参数错误
			-ERR_SYS		-	系统错误
			-ERR_NOINIT		-	没初始化
			-ERR_NOCFG		-	没有配置
*	说明:	无
 ******************************************************************************/
int timer_heart_getconfig (u8 id, u32 *interval);


/******************************************************************************
*	函数:	timer_heart_start
*	功能:	周期定时模式下启动周期触发
*	参数:	id				-	定时器通道号
*	返回:	0				-	成功
			-ERR_NOFUN		-	无此功能
			-ERR_INVAL		-	参数错误
			-ERR_SYS		-	系统错误
			-ERR_NOINIT		-	没初始化
			-ERR_NOCFG		-	没有配置
*	说明:	无
 ******************************************************************************/
int timer_heart_start(u8 id);


/******************************************************************************
*	函数:	timer_heart_wait
*	功能:	周期定时模式下等待周期触发
*	参数:	id				-	定时器通道号
*	返回:	0				-	成功
			-ERR_NOFUN		-	无此功能
			-ERR_INVAL		-	参数错误
			-ERR_SYS		-	系统错误
			-ERR_NOINIT		-	没初始化
*	说明:	无
 ******************************************************************************/
int timer_heart_wait (u8 id);

/******************************************************************************
*	函数:	timer_pwm_setconfig
*	功能:	设置或改变PWM功能的频率，占空比等参数
*	参数:	id				-	定时器号
			freq			-	脉宽调制频率
			fz				-	占空比分子
			fm				-	占空比分母
*	返回:	0				-	成功
			-ERR_NOFUN		-	无此功能
			-ERR_INVAL		-	参数错误
			-ERR_SYS		-	系统错误
			-ERR_NOINIT		-	没初始化
			-ERR_OTHER		-	其他关于系统线程锁的错误
*	说明:	当改变频率输出时，各种参数为0时，表示不改变其值
 ******************************************************************************/
int timer_pwm_setconfig (u8 id, u16 freq, u8 fz, u8 fm);

/******************************************************************************
*	函数:	timer_pwm_getconfig
*	功能:	获取PWM功能的频率，占空比等参数
*	参数:	id				-	定时器号
			freq			-	脉宽调制频率（数据传出）
			fz				-	占空比分子（数据传出）
			fm				-	占空比分母（数据传出）
*	返回:	0				-	成功
			-ERR_NOFUN		-	无此功能
			-ERR_INVAL		-	参数错误
			-ERR_NOINIT		-	没有初始化
*	说明:	无
 ******************************************************************************/
int timer_pwm_getconfig (u8 id, u16 *freq, u8 *fz, u8 *fm);


/******************************************************************************
*	函数:	timer_measure_read
*	功能:	读取频率测量功能的频率
*	参数:	id				-	定时器通道号
			freq			-	读取的频率
*	返回:	0				-	成功
			-ERR_NOFUN		-	无此功能
			-ERR_INVAL		-	参数错误
			-ERR_SYS		-	系统错误
			-ERR_NOINIT		-	没初始化
*	说明:	无
 ******************************************************************************/
int timer_measure_read(u8 id, u16 *freq);


/******************************************************************************
*	函数:	timer_close
*	功能:	关闭定时器
*	参数:	id				-	定时器通道号
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	参数无效
			-ERR_NOINIT		-	没有初始化
			-ERR_OTHER		-	其他关于线程锁的错误
*	说明:	无
 ******************************************************************************/
int timer_close (u8 id);

#endif  /* _TIMER_H */
