/*****************************************************************************/
/*许继电气股份有限公司                                     版权：2008-2015   */
/*****************************************************************************/
/* 本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许    */
/* 可不得擅自修改或发布，否则将追究相关的法律责任。                          */
/*                                                                           */
/*                      河南许昌许继股份有限公司                             */
/*                      www.xjgc.com                                         */
/*                      (0374) 321 2924                                      */
/*                                                                           */
/*****************************************************************************/


/******************************************************************************
    项目名称    ：  SGE800计量智能终端平台
    文件名         ：  c-tx-msg-init.c
    描述	       ：  本文件用于平台库msg_init函数的测试
    版本              ：  0.1
    作者              ：  孙锐
    创建日期    ：  2010.03
******************************************************************************/

//C库头文件
#include <stdio.h>			//printf
#include <stdlib.h>			//exit
#include <unistd.h>			//sleep
#include <db.h>

//平台库头文件
#include "../include/msg.h"
#include "../include/xj_assert.h"
#include "../include/error.h"
int main()
{
	int ret;
	//环境的初始化
	inittest();

	/*********测试用例1**************/
	ret = msg_init();                //模块初始化
	assert(ret==0,"test1:msg init fail!");

	/*********测试用例2**************/
	ret = msg_init();                //模块重复初始化
	assert(ret==-ERR_BUSY,"test2:msg init fail!");

	finaltest();
	exit(0);
	}
