/*****************************************************************************
	许继电气股份有限公司			版权：2008-2015

	本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许
	可不得擅自修改或发布，否则将追究相关的法律责任。

						河南许昌许继股份有限公司
						www.xjgc.com
						(0374) 321 2924
*****************************************************************************/

/******************************************************************************
	项目名称	：SGE800计量智能终端平台
	文件		：msg.h
	描述		：本文件定义了消息服务模块接口
	版本		：0.1
	作者		：万鸿俊
	创建日期	：2009.12
******************************************************************************/
	
#ifndef _MSG_H
#define _MSG_H

#include "typedef.h"
/*************************************************
  宏定义
*************************************************/
//消息优先级
#define MSG_PRIO_MIN	 			0				//最低优先级
#define MSG_PRIO_MAX				99				//最高优先级
//消息获取阻塞
#define MSG_RECV_BLOCK				0				//阻塞接收消息
#define MSG_RECV_NONBLOCK			0xffff			//非阻塞接收消息


/*************************************************
  结构类型定义
*************************************************/
typedef struct{
    u16  type;             //消息类型
    u16  wpara;            //消息参数
    u32  lpara;            //消息附加信息
    u32  priv;
} msg_t;
	



/*************************************************
  API
*************************************************/
/******************************************************************************
*	函数:	msg_init
*	功能:	消息服务模块初始化
*	参数:	无
*	返回:	0				-	成功
 			-ERR_SYS		- 	系统异常
 			-ERR_BUSY		- 	模块已初始化
*	说明:
 ******************************************************************************/
int msg_init(void);

/******************************************************************************
*	函数:	msg_send
*	功能:	发送消息
*	参数:	id				-	消息队列号
 			msg				-	消息（数据传入）
 			prio			-	优先级（0为最低，99为最高）
*	返回:	0				-	成功
 			-ERR_SYS		-	系统异常
 			-ERR_NOINIT		-	模块未初始化
 			-ERR_NODEV		-	无此消息队列
 			-ERR_INVAL		-	参数错误
 			-ERR_NOMEM		-	消息队列满
*	说明:
 ******************************************************************************/
int msg_send(u8 id, msg_t *msg, u8 prio);

/******************************************************************************
*	函数:	msg_recv
*	功能:	接收消息
*	参数:	id				-	消息队列号
 			msg				-	消息（数据传出）
 			timeout			-	超时时间（0为永久等待，0xffff为不等待，其余为等待秒数）
*	返回:	0				-	成功
 			-ERR_SYS		-	系统异常
 			-ERR_NODEV		-	无此消息队列
 			-ERR_NOINIT		-	模块未初始化
 			-ERR_TIMEOUT	-	超时未接收到消息
*	说明:
 ******************************************************************************/
int msg_recv(u8 id, msg_t *msg, u16 timeout);

/******************************************************************************
*	函数:	msg_recv_prio
*	功能:	接收优先消息
*	参数:	id				-	消息队列号
 			msg				-	消息（数据传出）
 			timeout			-	超时时间（0为永久等待，0xffff为不等待，其余为等待秒数）
*	返回:	0				-	成功
 			-ERR_SYS		-	系统异常
 			-ERR_NODEV		-	无此消息队列
 			-ERR_NOINIT		-	模块未初始化
 			-ERR_TIMEOUT	-	超时未接收到消息
*	说明:
 ******************************************************************************/
int msg_recv_prio(u8 id, msg_t *msg, u16 timeout);

/******************************************************************************
*	函数:	msg_clear
*	功能:	清空消息
*	参数:	id				-	消息队列号
*	返回:	0				-	成功
 			-ERR_SYS		-	系统异常
 			-ERR_NODEV		-	无此消息队列
 			-ERR_NOINIT		-	模块未初始化
*	说明:
 ******************************************************************************/
int msg_clear(u8 id);

/******************************************************************************
*	函数:	msg_getsize
*	功能:	获得消息数量
*	参数:	id				-	消息队列号
*	返回:	>0				-	消息数量
 			-ERR_SYS		-	系统异常
 			-ERR_NODEV		-	无此消息队列
 			-ERR_NOINIT		-	模块未初始化
*	说明:
 ******************************************************************************/
int msg_getsize(u8 id);


#endif  /* _MSG_H */

