/*****************************************************************************
	许继电气股份有限公司			版权：2008-2015

	本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许
	可不得擅自修改或发布，否则将追究相关的法律责任。

						河南许昌许继股份有限公司
						www.xjgc.com
						(0374) 321 2924
*****************************************************************************/


/******************************************************************************
	项目名称	：  SGE800计量智能终端平台
	文件		：  dcsig.c
	描述		：  本文件定义了直流模拟量模块的接口
	版本		：  0.1
	作者		：  路冉冉
	创建日期	：  2010.01
******************************************************************************/
//库配置头文件
#include "private/config.h"
	
//模块启用开关
#ifdef CFG_DCSIG_MODULE
//C库头文件
#include <stdio.h>
#include <fcntl.h> 		//open 标志	
#include <sys/ioctl.h>		//ioctl
#include <string.h> 		//memset
#include <unistd.h>		//close
	
//提供给用户的头文件
#include "include/dcsig.h"
#include "include/adc.h"
#include "include/error.h"
	
//驱动调用头文件
#include "private/debug.h"
	
/*************************************************
  静态全局变量及宏定义
*************************************************/
static u8 	dcsig_count = 0;			//模快打开计数

/*************************************************
  API
*************************************************/
/******************************************************************************
*	函数:	dcsig_init
*	功能:	AD转换模块初始化
*	参数:	无
*	返回:	0				-	成功
			-ERR_BUSY		-	已经打开
*	说明:	其它错误为adc.h中关于adc_init()返回的错误
 ******************************************************************************/
int dcsig_init(void)
{
	int ret = -1;

	if(dcsig_count == 1){
		ret = -ERR_BUSY;		//已经打开
		goto err;
	}	
	
	ret = adc_init();
	if((ret < 0) && (ret != -ERR_BUSY)){
		goto err;
	}

	dcsig_count = 1;
	ret = 0;
err:
	return ret;
}

/******************************************************************************
*	函数:	dcsig_setwaittime
*	功能:	设置直流模拟量读取超时时间
*	参数:	timeout			-	超时时间
*	返回:	0				-	成功
*	说明:	timeout单位是100ms
 ******************************************************************************/
int dcsig_setwaittime(u16 timeout)
{
	adc_setwaittime(timeout);
	return 0;	
}

/******************************************************************************
*	函数:	dcsig_getwaittime
*	功能:	获取直流模拟量读取超时时间
*	参数:	timeout			-	超时时间（数据传出指针）
*	返回:	0				-	成功
*	说明:	timeout单位是100ms
 ******************************************************************************/
int dcsig_getwaittime(u16 *timeout)
{
	adc_getwaittime(timeout);
	return 0;
}	

/******************************************************************************
*	函数:	dcsig_read
*	功能:	读取直流模拟量结果
*	参数:	id				-	直流模拟量通道号
			result			-	放大10000倍的电压值（数据传出指针）
*	返回:	0				-	成功
*	说明:	其它错误为adc.h中关于adc_read()返回的错误
 ******************************************************************************/
int dcsig_read(u8 id, u32 *result)
{
	int ret = -1;
	u16 adc_result;
	//读取数据
	ret = adc_read(id, &adc_result);
	if(ret < 0){
		goto err;
	}
	*result = adc_result*10000*(CFG_DCSIG_REFH - CFG_DCSIG_REFL)/((1<<CFG_DCSIG_BIT)-1)
			+CFG_DCSIG_REFL*10000;
	ret = 0;
err:	
	return ret;
}

/******************************************************************************
*	函数:	dcsig_close
*	功能:	关闭直流模拟量模块
*	参数:	无
*	返回:	0				-	成功
			-ERR_NOINIT		-	没有初始化
*	说明:	其它错误为adc.h中关于adc_close()返回的错误
 ******************************************************************************/
int dcsig_close(void)
{
	int ret;
	if(dcsig_count == 0){
		return -ERR_NOINIT;
	}
	ret = adc_close();
	if(ret < 0){
		return ret;
	}
	dcsig_count = 0;
	return 0;
}
#endif
