/******************************************************************************
 * 许继电气股份有限公司                                    版权：2008-2015    *
 ******************************************************************************
 * 本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许     *
 * 可不得擅自修改或发布，否则将追究相关的法律责任。                           *
 *                                                                            *
 *                       河南许昌许继股份有限公司                             *
 *                       www.xjgc.com                                         *
 *                       (0374) 321 2924                                      *
 *                                                                            *
 ******************************************************************************
 *
 * 项目名称		:	内部adc驱动程序在应用层头文件
 * 文件名		:	adilib.h
 * 描述			:	应用程序所用到的ioctl函数的命令及arg参数,read函数参数.
 * 版本			:	1.0.1
 * 作者			:	路冉冉
 *
 * 修改历史记录	:
 * --------------------
 * 01a, 18aug2009, Roy modified
 * --------------------
 *
 ******************************************************************************/
	
#ifndef _ADILIB_H
#define _ADILIB_H

#define ADI_IOC_MAGIC	108		//ioctl cmd幻数

#define 	DS_ADI_CH			_IO(ADI_IOC_MAGIC, 1) 	//设置id通道



#endif  /* _ADILIB_H */
