/*****************************************************************************
	许继电气股份有限公司			版权：2008-2015

	本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许
	可不得擅自修改或发布，否则将追究相关的法律责任。

						河南许昌许继股份有限公司
						www.xjgc.com
						(0374) 321 2924
*****************************************************************************/


/******************************************************************************
	项目名称	：SGE800计量智能终端平台
	文件名	：syn.h
	描述		：本文件定义了同步模块接口
	版本		：0.1
	作者		：孙锐
	创建日期	：2009.12
******************************************************************************/

#ifndef _SYN_H
#define _SYN_H

#include "typedef.h"

/*************************************************
  宏定义
*************************************************/

//同步获取阻塞
#define SYN_RECV_BLOCK				0           //阻塞方式
#define SYN_RECV_NONBLOCK			0xff		//非阻塞方式
/******************************************************************************
*	函数:	syn_init
*	功能:	初始化同步模块
*	参数:	无
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误

*	说明:	初始化数据库环境和数据库变量。
******************************************************************************/
int syn_init(void);

/******************************************************************************
*	函数:	syn_mutex_init
*	功能:	创建互斥锁
*	参数:	id				-	互斥锁标号
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
			-ERR_BUSY		-	此互斥锁已初始化

*	说明:	无
******************************************************************************/
int syn_mutex_init(u8 id);

/******************************************************************************
*	函数:	syn_mutex_lock
*	功能:	锁定互斥锁
*	参数:	id				-	互斥锁标号
			timeout      	-	0为永久等待，0xffff为不等待，其余为等待秒数
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
			-ERR_NOINIT  	-	 此互斥锁未初始化（未使用）
 			-ERR_BUSY   	-	已被其他线程锁定
 			-ERR_TIMEOUT 	-	超时
*	说明:	无
******************************************************************************/
int syn_mutex_lock(u8 id, u16 timeout);

/******************************************************************************
*	函数:	syn_mutex_unlock
*	功能:	解除互斥锁
*	参数:	id				-	互斥锁标号
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
			-ERR_NOINIT  	-	 此互斥锁未初始化（未使用）
*	说明:	无
******************************************************************************/
int syn_mutex_unlock(u8 id);

/******************************************************************************
*	函数:	syn_mutex_destroy
*	功能:	销毁互斥锁
*	参数:	id				-	互斥锁标号
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
			-ERR_NOINIT  	-	 此互斥锁未初始化（未使用）
 			-ERR_BUSY  		-	被锁定不能销毁
*	说明:	无
******************************************************************************/
int syn_mutex_destroy(u8 id);

/******************************************************************************
*	函数:	syn_sem_init
*	功能:	初始化信号量
*	参数:	id				-	信号量标号
			value			-	信号量初值
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
			-ERR_BUSY  		-	 此信号量已初始化
*	说明:	无
******************************************************************************/
int syn_sem_init(u8 id, int value);

/******************************************************************************
*	函数:	syn_sem_wait
*	功能:	信号量减一
*	参数:	id				-	信号量标号
			timeout    		-	0为永久等待，0xffff为不等待，其余为等待秒数
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
			-ERR_BUSY  		-	 信号量已为锁定状态，不能立刻锁定
*	说明:	无
******************************************************************************/
int syn_sem_wait(u8 id, u16 timeout);

/******************************************************************************
*	函数:	syn_sem_post
*	功能:	信号量加一，同时发出信号唤醒等待
*	参数:	id				-	信号量标号
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
			-ERR_NOINIT		-	此信号量未初始化
*	说明:	无
******************************************************************************/
int syn_sem_post(u8 id);

/******************************************************************************
*	函数:	syn_sem_getvalue
*	功能:	获得信号量的值
*	参数:	id				-	信号量标号
			value      		-	信号量值（返回）
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
			-ERR_NOINIT		-	此信号量未初始化
*	说明:	无
******************************************************************************/
int syn_sem_getvalue(u8 id, int *value);

/******************************************************************************
*	函数:	syn_sem_destroy
*	功能:	销毁信号量
*	参数:	id				-	信号量标号
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
			-ERR_NOINIT		-	此信号量未初始化
*	说明:	无
******************************************************************************/
int syn_sem_destroy(u8 id);

/******************************************************************************
*	函数:	syn_rwlock_init
*	功能:	读写锁初始化
*	参数:	id				-	读写锁标号
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
			-ERR_BUSY		-	此读写锁已初始化
*	说明:	无
******************************************************************************/
int syn_rwlock_init(u8 id);

/******************************************************************************
*	函数:	syn_rwlock_rd
*	功能:	获取读锁
*	参数:	id				-	读写锁标号
			timeout     	-	0:永久等待；0xffff表示不等待，不支持超时时间
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
			-ERR_BUSY		-	已被其他线程锁定
			-ERR_NOINIT  	-	此读写锁未初始化（未使用）
			-ERR_TIMEOUT	-	超时
*	说明:	无
******************************************************************************/
int syn_rwlock_rd(u8 id, u8 timeout);

/******************************************************************************
*	函数:	syn_rwlock_wr
*	功能:	获取写锁
*	参数:	id				-	读写锁标号
			timeout     	-	0:永久等待；0xffff表示不等待，不支持超时时间
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
			-ERR_BUSY		-	已被其他线程锁定
			-ERR_NOINIT  	-	此读写锁未初始化（未使用）
			-ERR_TIMEOUT	-	超时
*	说明:	无
******************************************************************************/
int syn_rwlock_wr(u8 id, u8 timeout);

/******************************************************************************
*	函数:	syn_rwlock_unlock
*	功能:	解除锁
*	参数:	id				-	读写锁标号
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
			-ERR_NOINIT  	-	此读写锁未初始化（未使用）
*	说明:	无
******************************************************************************/
int syn_rwlock_unlock(u8 id);

/******************************************************************************
*	函数:	syn_rwlock_destroy
*	功能:	销毁互斥锁
*	参数:	id				-	读写锁标号
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口参数设置错误
			-ERR_NOINIT  	-	此读写锁未初始化（未使用）
			-ERR_BUSY 		-	被锁定不能销毁
*	说明:	无
******************************************************************************/
int syn_rwlock_destroy(u8 id);

#endif
