/*****************************************************************************
	许继电气股份有限公司			版权：2008-2015

	本源代码及其相关文档为河南许昌许继电气股份有限公司独家所有，未经明文许
	可不得擅自修改或发布，否则将追究相关的法律责任。

						河南许昌许继股份有限公司
						www.xjgc.com
						(0374) 321 2924
*****************************************************************************/


/******************************************************************************
	项目名称	：  SGE800计量智能终端平台
	文件		：  powercheck.h
	描述		：  本文件定义了电源检测模块接口
	版本		：  0.1
	作者		：  万鸿俊
	创建日期	：  2009.09
******************************************************************************/

#ifndef _POWERCHECK_H
#define _POWERCHECK_H

#include "typedef.h"
/*************************************************
  宏定义
*************************************************/
//掉电检测模式
#define POWERCHECK_MODE_NOBLOCK			0			//非阻塞模式
#define POWERCHECK_MODE_BLOCK_UP		1			//阻塞模式-上电触发
#define POWERCHECK_MODE_BLOCK_DOWN		2			//阻塞模式-掉电触发
#define POWERCHECK_MODE_BLOCK_UPDOWN	3			//阻塞模式-上电掉电均触发


/*************************************************
  结构类型定义
*************************************************/




/*************************************************
  API
*************************************************/
/******************************************************************************
*	函数:	powercheck_init
*	功能:	掉电检测模块初始化
*	参数:	mode			-	掉电检测模式
*	返回:	0				-	成功
			-ERR_NOFILE		-	没有此路径
			-ERR_BUSY		-	设备忙，已经打开
			-ERR_SYS		-	初始化锁失败，如内存不足；已经初始化
*	说明:	无
 ******************************************************************************/
int powercheck_init (u8 mode);


/******************************************************************************
*	函数:	powercheck_setwaittime
*	功能:	阻塞模式下设置阻塞时间
*	参数:	timeout：阻塞时间（单位是100ms，为0表示永久阻塞）
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_NOINIT  	-	模块未初始化
*	说明:	无
 ******************************************************************************/
int powercheck_setwaittime (u16 timeout);


/******************************************************************************
*	函数:	powercheck_getwaittime
*	功能:	读取当前设置的阻塞时间
*	参数:	timeout：阻塞时间（单位是100ms，为0表示永久阻塞）（数据传出）
*	返回:	0				-	成功
			-ERR_NOINIT		-	模块未初始化
*	说明:	无
 ******************************************************************************/
int powercheck_getwaittime (u16 *timeout);


/******************************************************************************
*	函数:	powercheck_check
*	功能:	检测当前电源状态
*	参数:	无
*	返回:	0				-	掉电状态
			1				-	上电状态
			-ESYS			-	系统错误
			-ERR_NOINIT		-	模块未初始化
*	说明:	无
 ******************************************************************************/
int powercheck_check (void);


/******************************************************************************
*	函数:	powercheck_close
*	功能:	关闭掉电检测模块
*	参数:	无
*	返回:	0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_NOINIT		-	模块未初始化
*	说明:	无
 ******************************************************************************/
int powercheck_close (void);

#endif
