/******************************************************************************
	项目名称	：  SGE800计量智能终端平台
	文件		：  key.h
	描述		：  本文件定义了键盘模块的接口
	版本		：  0.1
	作者		：  路冉冉
	创建日期	：  2010.04
******************************************************************************/
#ifndef _KEY_H
#define _KEY_H

//#include "sge_core/typedef.h"
	
/*************************************************
  静态全局变量及宏定义
*************************************************/
#define KEY_UP			1		//按键上
#define KEY_DOWN		2		//按键下
#define KEY_LEFT		3		//按键左
#define KEY_RIGHT		4		//按键右
#define KEY_ENTER		5		//按键确认
#define KEY_CANCEL		6		//按键取消


#define KEY_PROGREM		91		//编程键

/*************************************************
  API
*************************************************/
/******************************************************************************
*	函数:	key_init
*	功能:	按键模块初始化
*	参数:	无
*	返回:	0				-	成功
			-ERR_CFG		-	配置超限
			-ERR_BUSY		-	已经打开
	说明:本函数出错，大部分返回gpio.h中gpio_init及gpio_set函数的错误
 ******************************************************************************/
int key_init(void);

#endif		//_KEY_H
