/******************************************************************************
	项目名称	：  SGE800计量智能终端业务平台
	文件		：  ether.h
	描述		：  本文件定义了网络设备的接口
	版本		：  0.1
	作者		：  万鸿俊
	创建日期	：  2010.12
******************************************************************************/
#ifndef _ETHER_H
#define _ETHER_H

#include "sge_core/typedef.h"
	
/*************************************************
  宏定义
*************************************************/
//网卡编号
#define ETHER_0		0		//eth0

//连接模式定义
#define ETHER_MODE_TCP_CLIENT	0
#define ETHER_MODE_TCP_SERVER	1
#define ETHER_MODE_UDP_CLIENT	2
#define ETHER_MODE_UDP_SERVER	3

//设置项定义
#define ETHER_CONFIG_TYPE_IP		0
#define ETHER_CONFIG_TYPE_GATEWAY	1
#define ETHER_CONFIG_TYPE_MASK		2

/*************************************************
  结构类型定义
*************************************************/
typedef struct {
/******************************************************************************
*	函数:	config
*	功能:	网络设备配置函数
*	参数:	type			-	配置参数类型
*			cfg				-	配置参数字符串
*	返回:	0				-	成功
			-ERR_INVAL		- 	参数出错
			-ERR_SYS		-	系统错误
*	说明:	根据type不同，分别可以配置ip地址，网关，子网掩码。
 ******************************************************************************/
	int (*config) (u8 type, char *cfg);
/******************************************************************************
*	函数:	connect
*	功能:	网络连接函数
*	参数:	mode			-	连接模式，分为tcp和udp，又分别分为服务器和客户端
*	返回:	0				-	成功
			-ERR_INVAL		- 	参数出错
			-ERR_BUSY		-	设备忙，连接太多
			-ERR_SYS		-	系统错误
			-ERR_DISCONNECT	-	连接已断开
			-ERR_OTHER		-	创建线程出错
*	说明:	本地服务器连接时，ip可为null
 ******************************************************************************/
	int (*connect)(u8 mode, char *ip, u16 port);
/******************************************************************************
*	函数:	disconnect
*	功能:	网络断开连接函数
*	参数:	nd				-	连接号
*	返回:	0				-	成功
			-ERR_INVAL		- 	参数出错
			-ERR_BUSY		-	设备忙，连接太多
			-ERR_SYS		-	系统错误
*	说明:   根据nd的不同断开连接外部服务器的本地客户端连接(nd最高位为0)，
*			 和断开外部客户端连接本地服务器的连接(nd最高位为1)
 ******************************************************************************/
	int (*disconnect)(u8 nd);
/******************************************************************************
*	函数:	senddata
*	功能:	网络数据发送函数
*	参数:	nd				-	连接号
*			buf				-	发送数据缓冲区
*			count			-	发送数据大小
*	返回:	0				-	成功
			-ERR_INVAL		- 	参数出错
			-ERR_SYS		-	系统错误
			-ERR_DISCONNECT	-	连接已经断开
			-ERR_TIMEOUT	-	发送超时
*	说明:
 ******************************************************************************/
	int (*senddata)(u8 nd, u8 *buf, u32 count);
} ether_device_t;

extern ether_device_t ether_device[];

#endif		//_ETHER_H
