/******************************************************************************
	项目名称	：  SGE800计量智能终端平台
	文件		：  powerd.h
	描述		：  本文件定义了掉电检测设备的接口
	版本		：  0.1
	作者		：  路冉冉
	创建日期	：  2010.12
******************************************************************************/
#ifndef _POWERD_H
#define _POWERD_H

#include "sge_core/typedef.h"
	
/*************************************************
  静态全局变量及宏定义
*************************************************/
#define POWER_UP		1		//上电
#define POWER_DOWN		0		//掉电

/*************************************************
  API
*************************************************/
/******************************************************************************
*	函数:	powerd_init
*	功能:	掉电检测设备初始化
*	参数:	mode			-	掉电检测模式
*	返回:	0				-	成功
			-ERR_NOFILE		-	没有此路径
			-ERR_BUSY		-	设备忙，已经打开
			-ERR_SYS		-	初始化锁失败，如内存不足；已经初始化
*	说明:	无
 ******************************************************************************/
int powerd_init ();

#endif
